# MySQL in JupyterTutorial

By Matthew Gerardino

**Important:** pip install MySQL Connector

In [1]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
  host="127.0.0.1",
  user="root",
  password="",
  database="sakila"
)

mycursor = mydb.cursor()

#### Check if you have a successfull conection by listing out the tables in your sakila db:

In [2]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('actor',)
('actor_info',)
('address',)
('category',)
('city',)
('country',)
('customer',)
('customer_list',)
('film',)
('film_actor',)
('film_category',)
('film_list',)
('film_text',)
('inventory',)
('language',)
('nicer_but_slower_film_list',)
('payment',)
('rental',)
('sales_by_film_category',)
('sales_by_store',)
('staff',)
('staff_list',)
('store',)

## Primary Key
When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

### Example
Create primary key when creating the table:

In [3]:
# mycursor = mydb.cursor()

# mycursor.execute("CREATE TABLE DSO_Team (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

In [4]:
#testing this out

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE DSO_Team (name VARCHAR(255), address VARCHAR(255), DateUpdated datetime default current_timestamp)")

### Example
Create primary key on an existing table:

In [5]:
mycursor.execute("ALTER TABLE DSO_Team ADD COLUMN id INT AUTO_INCREMENT NOT NULL PRIMARY KEY")

## Python MySQL Insert Into Table

#### Insert Into Table
To fill a table in MySQL, use the "INSERT INTO" statement.

In [6]:
sql = "INSERT INTO DSO_Team (name, address) VALUES (%s, %s)"
val = ("Ashley", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

# Insert Multiple Rows
#### To insert multiple rows into a table, use the executemany() method.

The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [7]:
sql = "INSERT INTO DSO_Team (name, address) VALUES (%s, %s)"
val = [
  ('Joseph', 'Highstreet 4'),
  ('Daniel', 'Apple st 652'),
  ('Margaret', 'Mountain 21'),
  ('Nolan', 'Valley 345'),
  ('Matthew', 'Ocean blvd 2'),
  ('Julie', 'Green Grass 1'),
  ('Julia', 'Sky st 331'),
  ('Emily', 'One way 98'),
  ('Mia', 'Yellow Garden 2'),
  ('Latrice', 'Park Lane 38'),
  ('Marisa', 'Central st 954'),
  ('Melissa', 'Main Road 989'),
  ('Jessenia', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "entries were added.")

13 entries were added.

# Get Inserted ID
#### You can get the id of the row you just inserted by asking the cursor object.
### Get Inserted ID
You can get the id of the row you just inserted by asking the cursor object.

In [8]:
sql = "INSERT INTO DSO_Team (name, address) VALUES (%s, %s)"
val = ("Brittney", "Blue Village")
mycursor.execute(sql, val)

mydb.commit()

print("1 record inserted, ID:", mycursor.lastrowid)

1 record inserted, ID: 15

## Show DSO_Team As a Pandas Data Fame
#### Using Select All

In [9]:
team=pd.read_sql("Select * from DSO_Team", con = mydb)
team.head(15)

        name          address         DateUpdated  id
0     Ashley       Highway 21 2021-11-17 21:11:45   1
1     Joseph     Highstreet 4 2021-11-17 21:11:46   2
2     Daniel     Apple st 652 2021-11-17 21:11:46   3
3   Margaret      Mountain 21 2021-11-17 21:11:46   4
4      Nolan       Valley 345 2021-11-17 21:11:46   5
5    Matthew     Ocean blvd 2 2021-11-17 21:11:46   6
6      Julie    Green Grass 1 2021-11-17 21:11:46   7
7      Julia       Sky st 331 2021-11-17 21:11:46   8
8      Emily       One way 98 2021-11-17 21:11:46   9
9        Mia  Yellow Garden 2 2021-11-17 21:11:46  10
10   Latrice     Park Lane 38 2021-11-17 21:11:46  11
11    Marisa   Central st 954 2021-11-17 21:11:46  12
12   Melissa    Main Road 989 2021-11-17 21:11:46  13
13  Jessenia     Sideway 1633 2021-11-17 21:11:46  14
14  Brittney     Blue Village 2021-11-17 21:11:46  15

## Show DSO_Team As a Table
#### Using Select All
To select from a table in MySQL, use the "SELECT" statement:

In [10]:
mycursor.execute("SELECT * FROM DSO_Team")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Ashley', 'Highway 21', datetime.datetime(2021, 11, 17, 21, 11, 45), 1)
('Joseph', 'Highstreet 4', datetime.datetime(2021, 11, 17, 21, 11, 46), 2)
('Daniel', 'Apple st 652', datetime.datetime(2021, 11, 17, 21, 11, 46), 3)
('Margaret', 'Mountain 21', datetime.datetime(2021, 11, 17, 21, 11, 46), 4)
('Nolan', 'Valley 345', datetime.datetime(2021, 11, 17, 21, 11, 46), 5)
('Matthew', 'Ocean blvd 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 6)
('Julie', 'Green Grass 1', datetime.datetime(2021, 11, 17, 21, 11, 46), 7)
('Julia', 'Sky st 331', datetime.datetime(2021, 11, 17, 21, 11, 46), 8)
('Emily', 'One way 98', datetime.datetime(2021, 11, 17, 21, 11, 46), 9)
('Mia', 'Yellow Garden 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 10)
('Latrice', 'Park Lane 38', datetime.datetime(2021, 11, 17, 21, 11, 46), 11)
('Marisa', 'Central st 954', datetime.datetime(2021, 11, 17, 21, 11, 46), 12)
('Melissa', 'Main Road 989', datetime.datetime(2021, 11, 17, 21, 11, 46), 13)
('Jessenia', 'Sideway 1633', datetime.datetime(2021, 11, 17, 21, 11, 46), 14)
('Brittney', 'Blue Village', datetime.datetime(2021, 11, 17, 21, 11, 46), 15)

# Selecting Columns
To select only some of the columns in a table, use the "SELECT" statement followed by the column name(s):

### Example
Select only the name and address columns:

In [11]:
mycursor.execute("SELECT name, address FROM DSO_Team")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Ashley', 'Highway 21')
('Joseph', 'Highstreet 4')
('Daniel', 'Apple st 652')
('Margaret', 'Mountain 21')
('Nolan', 'Valley 345')
('Matthew', 'Ocean blvd 2')
('Julie', 'Green Grass 1')
('Julia', 'Sky st 331')
('Emily', 'One way 98')
('Mia', 'Yellow Garden 2')
('Latrice', 'Park Lane 38')
('Marisa', 'Central st 954')
('Melissa', 'Main Road 989')
('Jessenia', 'Sideway 1633')
('Brittney', 'Blue Village')

# Using the fetchone() Method
If you are only interested in one row, you can use the fetchone() method.

The fetchone() method will return the first row of the result:

#### Example
Fetch only one row:

In [12]:
# mycursor.execute("SELECT * FROM DSO_Team")

# myresult = mycursor.fetchone()

# print(myresult)

# Python MySQL Where
## Select With a Filter
When selecting records from a table, you can filter the selection by using the "WHERE" statement:

### Example
Select record(s) where the address is "Park Lane 38": result:

In [13]:
sql = "SELECT * FROM DSO_Team WHERE address ='Park Lane 38'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Latrice', 'Park Lane 38', datetime.datetime(2021, 11, 17, 21, 11, 46), 11)

# Wildcard Characters
You can also select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters:
    
### Example
Select records where the address contains the word "way":

In [14]:
sql = "SELECT * FROM DSO_Team WHERE address LIKE '%way%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Ashley', 'Highway 21', datetime.datetime(2021, 11, 17, 21, 11, 45), 1)
('Emily', 'One way 98', datetime.datetime(2021, 11, 17, 21, 11, 46), 9)
('Jessenia', 'Sideway 1633', datetime.datetime(2021, 11, 17, 21, 11, 46), 14)

## Prevent SQL Injection
When query values are provided by the user, you should escape the values.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

The mysql.connector module has methods to escape query values:

#### Example
Escape query values by using the placholder %s method:

In [15]:
mycursor = mydb.cursor()

sql = "SELECT * FROM DSO_Team WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Mia', 'Yellow Garden 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 10)

## Python MySQL Order By
#### Sort the Result
Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

#### Example
Sort the result alphabetically by name: result:

In [16]:
mycursor = mydb.cursor()

sql = "SELECT * FROM DSO_Team ORDER BY name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Ashley', 'Highway 21', datetime.datetime(2021, 11, 17, 21, 11, 45), 1)
('Brittney', 'Blue Village', datetime.datetime(2021, 11, 17, 21, 11, 46), 15)
('Daniel', 'Apple st 652', datetime.datetime(2021, 11, 17, 21, 11, 46), 3)
('Emily', 'One way 98', datetime.datetime(2021, 11, 17, 21, 11, 46), 9)
('Jessenia', 'Sideway 1633', datetime.datetime(2021, 11, 17, 21, 11, 46), 14)
('Joseph', 'Highstreet 4', datetime.datetime(2021, 11, 17, 21, 11, 46), 2)
('Julia', 'Sky st 331', datetime.datetime(2021, 11, 17, 21, 11, 46), 8)
('Julie', 'Green Grass 1', datetime.datetime(2021, 11, 17, 21, 11, 46), 7)
('Latrice', 'Park Lane 38', datetime.datetime(2021, 11, 17, 21, 11, 46), 11)
('Margaret', 'Mountain 21', datetime.datetime(2021, 11, 17, 21, 11, 46), 4)
('Marisa', 'Central st 954', datetime.datetime(2021, 11, 17, 21, 11, 46), 12)
('Matthew', 'Ocean blvd 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 6)
('Melissa', 'Main Road 989', datetime.datetime(2021, 11, 17, 21, 11, 46), 13)
('Mia', 'Yellow Garden 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 10)
('Nolan', 'Valley 345', datetime.datetime(2021, 11, 17, 21, 11, 46), 5)

## ORDER BY DESC
Use the DESC keyword to sort the result in a descending order.

#### Example
Sort the result reverse alphabetically by name:

In [17]:
mycursor = mydb.cursor()

sql = "SELECT * FROM DSO_Team ORDER BY name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Nolan', 'Valley 345', datetime.datetime(2021, 11, 17, 21, 11, 46), 5)
('Mia', 'Yellow Garden 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 10)
('Melissa', 'Main Road 989', datetime.datetime(2021, 11, 17, 21, 11, 46), 13)
('Matthew', 'Ocean blvd 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 6)
('Marisa', 'Central st 954', datetime.datetime(2021, 11, 17, 21, 11, 46), 12)
('Margaret', 'Mountain 21', datetime.datetime(2021, 11, 17, 21, 11, 46), 4)
('Latrice', 'Park Lane 38', datetime.datetime(2021, 11, 17, 21, 11, 46), 11)
('Julie', 'Green Grass 1', datetime.datetime(2021, 11, 17, 21, 11, 46), 7)
('Julia', 'Sky st 331', datetime.datetime(2021, 11, 17, 21, 11, 46), 8)
('Joseph', 'Highstreet 4', datetime.datetime(2021, 11, 17, 21, 11, 46), 2)
('Jessenia', 'Sideway 1633', datetime.datetime(2021, 11, 17, 21, 11, 46), 14)
('Emily', 'One way 98', datetime.datetime(2021, 11, 17, 21, 11, 46), 9)
('Daniel', 'Apple st 652', datetime.datetime(2021, 11, 17, 21, 11, 46), 3)
('Brittney', 'Blue Village', datetime.datetime(2021, 11, 17, 21, 11, 46), 15)
('Ashley', 'Highway 21', datetime.datetime(2021, 11, 17, 21, 11, 45), 1)

## Python MySQL Delete From By
Delete Record
You can delete records from an existing table by using the "DELETE FROM" statement:

#### Example
Delete any record where the address is "Mountain 21":

In [18]:
mycursor = mydb.cursor()

sql = "DELETE FROM DSO_Team WHERE address = 'Mountain 21'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

**Important:** Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

**Notice the WHERE clause in the DELETE syntax:** The WHERE clause specifies which record(s) that should be deleted. If you omit the WHERE clause, all records will be deleted!

## Prevent SQL Injection
It is considered a good practice to escape the values of any query, also in delete statements.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

The mysql.connector module uses the placeholder %s to escape values in the delete statement:

#### Example
Escape values by using the placeholder %s method:

In [19]:
mycursor = mydb.cursor()

sql = "DELETE FROM DSO_Team WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

## Python MySQL Update Table
Update Table
You can update existing records in a table by using the "UPDATE" statement:
    
#### Example
Overwrite the address column from "Valley 345" to "Canyoun 123":

In [20]:
mycursor = mydb.cursor()

sql = "UPDATE DSO_Team SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

## Python MySQL Limit
Limit the Result
You can limit the number of records returned from the query, by using the "LIMIT" statement:

#### Example
Select the 5 first records in the "DSO_Team" table:

In [21]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM DSO_Team LIMIT 5")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Ashley', 'Highway 21', datetime.datetime(2021, 11, 17, 21, 11, 45), 1)
('Joseph', 'Highstreet 4', datetime.datetime(2021, 11, 17, 21, 11, 46), 2)
('Daniel', 'Apple st 652', datetime.datetime(2021, 11, 17, 21, 11, 46), 3)
('Nolan', 'Canyon 123', datetime.datetime(2021, 11, 17, 21, 11, 46), 5)
('Matthew', 'Ocean blvd 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 6)

## Start From Another Position
If you want to return five records, starting from the third record, you can use the "OFFSET" keyword:

#### Example
Start from position 3, and return 5 records:

In [22]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM DSO_Team LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Daniel', 'Apple st 652', datetime.datetime(2021, 11, 17, 21, 11, 46), 3)
('Nolan', 'Canyon 123', datetime.datetime(2021, 11, 17, 21, 11, 46), 5)
('Matthew', 'Ocean blvd 2', datetime.datetime(2021, 11, 17, 21, 11, 46), 6)
('Julie', 'Green Grass 1', datetime.datetime(2021, 11, 17, 21, 11, 46), 7)
('Julia', 'Sky st 331', datetime.datetime(2021, 11, 17, 21, 11, 46), 8)

## Python MySQL Join
#### Join Two or More Tables
You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.

Consider you have a "users" table and a "products" table:

users

These two tables can be combined by using users' fav field and products' id field.

#### Example
Join users and products to see the name of the users favorite product:

In [23]:
# mycursor = mydb.cursor()

# sql = "SELECT \
#   users.name AS user, \
#   products.name AS favorite \
#   FROM users \
#   INNER JOIN products ON users.fav = products.id"

# mycursor.execute(sql)

# myresult = mycursor.fetchall()

# for x in myresult:
#   print(x)

## Python MySQL Drop Table
Delete a Table
You can delete an existing table by using the "DROP TABLE" statement:

#### Example
Delete the table "DSO_Team":

In [24]:
mycursor = mydb.cursor()

sql = "DROP TABLE DSO_Team"

mycursor.execute(sql)

## Drop Only if Exist
If the the table you want to delete is already deleted, or for any other reason does not exist, you can use the IF EXISTS keyword to avoid getting an error.

#### Example
Delete the table "DSO_Team" if it exists:

In [25]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS DSO_Team"

mycursor.execute(sql)

## Show Tables to verify that DSO_Team was deleted

In [26]:
show=pd.read_sql("Show Tables", con = mydb)
show.head(15)

   Tables_in_sakila
0             actor
1        actor_info
2           address
3          category
4              city
5           country
6          customer
7     customer_list
8              film
9        film_actor
10    film_category
11        film_list
12        film_text
13        inventory
14         language